In [1]:
import pandas as pd
from pyspark.sql import SparkSession

In [2]:
from pyspark.context import SparkContext

In [3]:
from pyspark.sql import functions

In [4]:
import os
os.environ['PYSPARK_PYTHON']

'python'

In [5]:
# Create SparkSession 
spark = SparkSession.builder \
      .master("local[4]") \
      .appName("SparkByExamples.com") \
      .getOrCreate()

In [6]:
rdd = spark.sparkContext.parallelize([1,2,3,4,5])

In [7]:
rdd.count()

5

In [8]:
dataList  = [('Java', 20000), ('Python', 10000), ('Scala', 5000)]

In [9]:
rdd = spark.sparkContext.parallelize(dataList)

In [10]:
rdd.count()

3

In [11]:
#from a txt file
rdd2 = spark.sparkContext.textFile("C:\\temp\\diamonds.csv")

In [12]:
rdd2

C:\temp\diamonds.csv MapPartitionsRDD[5] at textFile at NativeMethodAccessorImpl.java:0

In [13]:
rdd2.count()

53941

In [14]:
rdd2.first()

'"carat","cut","color","clarity","depth","table","price","x","y","z"'

In [15]:
rdd2.max()

'5.01,"Fair","J","I1",65.5,59,18018,10.74,10.54,6.98'

In [16]:
# Create DataFrame

In [17]:
data = [('James','','Smith','1991-04-01','M',3000),
  ('Michael','Rose','','2000-05-19','M',4000),
  ('Robert','','Williams','1978-09-05','M',4000),
  ('Maria','Anne','Jones','1967-12-01','F',4000),
  ('Jen','Mary','Brown','1980-02-17','F',-1)
]

In [18]:
data

[('James', '', 'Smith', '1991-04-01', 'M', 3000),
 ('Michael', 'Rose', '', '2000-05-19', 'M', 4000),
 ('Robert', '', 'Williams', '1978-09-05', 'M', 4000),
 ('Maria', 'Anne', 'Jones', '1967-12-01', 'F', 4000),
 ('Jen', 'Mary', 'Brown', '1980-02-17', 'F', -1)]

In [19]:
columns = ["firstname","middlename","lastname","dob","gender","salary"]

In [20]:
import pandas as pd

In [21]:
dfpd = pd.DataFrame(data=data, columns=columns)

In [22]:
dfpd

  firstname middlename  lastname         dob gender  salary
0     James                Smith  1991-04-01      M    3000
1   Michael       Rose            2000-05-19      M    4000
2    Robert             Williams  1978-09-05      M    4000
3     Maria       Anne     Jones  1967-12-01      F    4000
4       Jen       Mary     Brown  1980-02-17      F      -1

In [23]:
df = spark.createDataFrame(data=data, schema=columns)

In [24]:
df

DataFrame[firstname: string, middlename: string, lastname: string, dob: string, gender: string, salary: bigint]

In [25]:
df.printSchema()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

In [26]:
df.show()

+---------+----------+--------+----------+------+------+
|firstname|middlename|lastname|       dob|gender|salary|
+---------+----------+--------+----------+------+------+
|    James|          |   Smith|1991-04-01|     M|  3000|
|  Michael|      Rose|        |2000-05-19|     M|  4000|
|   Robert|          |Williams|1978-09-05|     M|  4000|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|
+---------+----------+--------+----------+------+------+

In [27]:
df = spark.read.csv("C:\\temp\\diamonds.csv", header=True)

In [28]:
df.show(1)

+-----+-----+-----+-------+-----+-----+-----+----+----+----+
|carat|  cut|color|clarity|depth|table|price|   x|   y|   z|
+-----+-----+-----+-------+-----+-----+-----+----+----+----+
| 0.23|Ideal|    E|    SI2| 61.5|   55|  326|3.95|3.98|2.43|
+-----+-----+-----+-------+-----+-----+-----+----+----+----+
only showing top 1 row

In [29]:
df.printSchema()

root
 |-- carat: string (nullable = true)
 |-- cut: string (nullable = true)
 |-- color: string (nullable = true)
 |-- clarity: string (nullable = true)
 |-- depth: string (nullable = true)
 |-- table: string (nullable = true)
 |-- price: string (nullable = true)
 |-- x: string (nullable = true)
 |-- y: string (nullable = true)
 |-- z: string (nullable = true)

In [30]:
#

In [31]:
rdd2 = spark.sparkContext.parallelize(data)

In [32]:
df5 = rdd2.toDF()
df5.printSchema()

root
 |-- _1: string (nullable = true)
 |-- _2: string (nullable = true)
 |-- _3: string (nullable = true)
 |-- _4: string (nullable = true)
 |-- _5: string (nullable = true)
 |-- _6: long (nullable = true)

In [33]:
df5.show()

+-------+----+--------+----------+---+----+
|     _1|  _2|      _3|        _4| _5|  _6|
+-------+----+--------+----------+---+----+
|  James|    |   Smith|1991-04-01|  M|3000|
|Michael|Rose|        |2000-05-19|  M|4000|
| Robert|    |Williams|1978-09-05|  M|4000|
|  Maria|Anne|   Jones|1967-12-01|  F|4000|
|    Jen|Mary|   Brown|1980-02-17|  F|  -1|
+-------+----+--------+----------+---+----+